#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vishnukap_learning/s3-website/runs/run-r67MLTKbSrud4HYo

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:805586991204:certificate/88f06708-4f66-4a62-b348-b98d782cc35c]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_s3_object.png["logo512.png"]: Refreshing state... [id=logo512.png]
aws_s3_object.js["static/js/main.9e3090d4.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.9e3090d4.js.LICENSE.txt]
aws_s3_object.png["logo192.png"]: Refreshing state... [id=logo192.png]
aws_s3_object.json["manifest.json"]: Refreshing state... [id=manifest.json]
aws_s3_object.json["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
aws_s3_object.js["static/js/787.71e672d5.chunk.js.map"]: Refreshing state... [id=static/js/787.71e672d5.chunk.js.map]
aws_s3_object.ico["favicon.ico"]: Refreshing state... [id=favicon.ico]
aws_s3_object.js["static/js/main.9e3090d4.js"]: Refreshing state... [id=static/js/main.9e3090d4.js]
aws_s3_object.js["static/js/main.9e3090d4.js.map"]: Refreshing state... [id=static/js/main.9e3090d4.js.map]
aws_s3_object.text["robots.txt"]: Refreshing state... [id=robots.txt]
aws_s3_object.js["static/js/787.71e672d5.chunk.js"]: Refreshing state... [id=static/js/787.71e672d5.chunk.js]
aws_s3_bucket.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_object.css["static/css/main.073c9b0a.css.map"]: Refreshing state... [id=static/css/main.073c9b0a.css.map]
aws_s3_object.css["static/css/main.073c9b0a.css"]: Refreshing state... [id=static/css/main.073c9b0a.css]
aws_s3_bucket_public_access_block.s3_static_website_pa_block: Refreshing state... [id=www.visham.org]
aws_s3_bucket_ownership_controls.s3_static_website_object_ownership: Refreshing state... [id=www.visham.org]
aws_s3_object.html["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_policy.allow_access: Refreshing state... [id=www.visham.org]
aws_s3_object.media["static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"]: Refreshing state... [id=static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg]
aws_s3_bucket_website_configuration.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_acl.s3_static_website_acl: Refreshing state... [id=www.visham.org,public-read]
aws_cloudfront_distribution.cdn: Refreshing state... [id=E17YUM5QUJCVXF]
aws_route53_record.dns: Refreshing state... [id=Z02024842F73WIP3EA0PB_visham.org_A]
aws_route53_record.www: Refreshing state... [id=Z02024842F73WIP3EA0PB_www.visham.org_A]
aws_s3_object.html["index.html"]: Drift detected (update)
aws_s3_object.json["asset-manifest.json"]: Drift detected (update)
aws_s3_object.json["manifest.json"]: Drift detected (update)
aws_s3_object.ico["favicon.ico"]: Drift detected (update)
aws_s3_object.css["static/css/main.073c9b0a.css"]: Drift detected (update)
aws_s3_object.css["static/css/main.073c9b0a.css.map"]: Drift detected (update)
aws_s3_object.js["static/js/787.71e672d5.chunk.js.map"]: Drift detected (update)
aws_s3_object.js["static/js/main.9e3090d4.js"]: Drift detected (update)
aws_s3_object.js["static/js/main.9e3090d4.js.LICENSE.txt"]: Drift detected (update)
aws_s3_object.js["static/js/main.9e3090d4.js.map"]: Drift detected (update)
aws_s3_object.js["static/js/787.71e672d5.chunk.js"]: Drift detected (update)
aws_s3_object.png["logo512.png"]: Drift detected (update)
aws_s3_object.png["logo192.png"]: Drift detected (update)
aws_s3_object.media["static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"]: Drift detected (update)
aws_s3_object.text["robots.txt"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_object.css["static/css/main.073c9b0a.css"] will be destroyed
  # (because key ["static/css/main.073c9b0a.css"] is not in for_each map)
  - resource "aws_s3_object" "css" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css" -> null
      - etag                   = "89d76f95e100fc61f7271096ce86e7fc" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.073c9b0a.css" -> null
      - key                    = "static/css/main.073c9b0a.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/static/css/main.073c9b0a.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.css["static/css/main.073c9b0a.css.map"] will be destroyed
  # (because key ["static/css/main.073c9b0a.css.map"] is not in for_each map)
  - resource "aws_s3_object" "css" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css" -> null
      - etag                   = "4284557f70f03d562b659f38b01eaa66" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.073c9b0a.css.map" -> null
      - key                    = "static/css/main.073c9b0a.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/static/css/main.073c9b0a.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.css["style.css"] will be created
  + resource "aws_s3_object" "css" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "ffacd46d941a9375ca5a36fa0271d6e8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "style.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/style.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.html["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "html" {
      ~ etag                   = "95d219399a97849a80163ed9549c6e27" -> "1482a25ca21d3d1e675bac2b95e7b55e"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.ico["favicon.ico"] will be destroyed
  # (because aws_s3_object.ico is not in configuration)
  - resource "aws_s3_object" "ico" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "image/vnd.microsoft.icon" -> null
      - etag                   = "c92b85a5b907c70211f4ec25e29a8c4a" -> null
      - force_destroy          = false -> null
      - id                     = "favicon.ico" -> null
      - key                    = "favicon.ico" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/favicon.ico" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.js["static/js/787.71e672d5.chunk.js"] will be destroyed
  # (because aws_s3_object.js is not in configuration)
  - resource "aws_s3_object" "js" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "d95602c8a8bdb73b00fa5ed23e902214" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/787.71e672d5.chunk.js" -> null
      - key                    = "static/js/787.71e672d5.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/static/js/787.71e672d5.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.js["static/js/787.71e672d5.chunk.js.map"] will be destroyed
  # (because aws_s3_object.js is not in configuration)
  - resource "aws_s3_object" "js" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "a124545a507d8b6b2410d0a25e9d7b02" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/787.71e672d5.chunk.js.map" -> null
      - key                    = "static/js/787.71e672d5.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/static/js/787.71e672d5.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.js["static/js/main.9e3090d4.js"] will be destroyed
  # (because aws_s3_object.js is not in configuration)
  - resource "aws_s3_object" "js" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "f5376be217783190e30afe1471a82404" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9e3090d4.js" -> null
      - key                    = "static/js/main.9e3090d4.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/static/js/main.9e3090d4.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.js["static/js/main.9e3090d4.js.LICENSE.txt"] will be destroyed
  # (because aws_s3_object.js is not in configuration)
  - resource "aws_s3_object" "js" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "b114cc85da504a772f040e3f40f8e46a" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9e3090d4.js.LICENSE.txt" -> null
      - key                    = "static/js/main.9e3090d4.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/static/js/main.9e3090d4.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.js["static/js/main.9e3090d4.js.map"] will be destroyed
  # (because aws_s3_object.js is not in configuration)
  - resource "aws_s3_object" "js" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "b4030ca9ffb0edccf1937f966b8bf9c0" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9e3090d4.js.map" -> null
      - key                    = "static/js/main.9e3090d4.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/static/js/main.9e3090d4.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.json["asset-manifest.json"] will be destroyed
  # (because aws_s3_object.json is not in configuration)
  - resource "aws_s3_object" "json" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/json" -> null
      - etag                   = "e83c852ba9db975803c4c5bad2ba6749" -> null
      - force_destroy          = false -> null
      - id                     = "asset-manifest.json" -> null
      - key                    = "asset-manifest.json" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/asset-manifest.json" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.json["manifest.json"] will be destroyed
  # (because aws_s3_object.json is not in configuration)
  - resource "aws_s3_object" "json" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/json" -> null
      - etag                   = "d9d975cebe2ec20b6c652e1e4c12ccf0" -> null
      - force_destroy          = false -> null
      - id                     = "manifest.json" -> null
      - key                    = "manifest.json" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/manifest.json" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.media["static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"] will be destroyed
  # (because key ["static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg"] is not in for_each map)
  - resource "aws_s3_object" "media" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "06e733283fa43d1dd57738cfc409adbd" -> null
      - force_destroy          = false -> null
      - id                     = "static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg" -> null
      - key                    = "static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/static/media/logo.6ce24c58023cc2f8fd88fe9d219db6c6.svg" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.media["terraform.svg"] will be created
  + resource "aws_s3_object" "media" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "13fb28b5e1d7598b9933cb25313621df"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "terraform.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./src/terraform.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.png["logo192.png"] will be destroyed
  # (because aws_s3_object.png is not in configuration)
  - resource "aws_s3_object" "png" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "image/x-png" -> null
      - etag                   = "33dbdd0177549353eeeb785d02c294af" -> null
      - force_destroy          = false -> null
      - id                     = "logo192.png" -> null
      - key                    = "logo192.png" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/logo192.png" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.png["logo512.png"] will be destroyed
  # (because aws_s3_object.png is not in configuration)
  - resource "aws_s3_object" "png" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "image/x-png" -> null
      - etag                   = "917515db74ea8d1aee6a246cfbcc0b45" -> null
      - force_destroy          = false -> null
      - id                     = "logo512.png" -> null
      - key                    = "logo512.png" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/logo512.png" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.text["robots.txt"] will be destroyed
  # (because aws_s3_object.text is not in configuration)
  - resource "aws_s3_object" "text" {
      - acl                    = "public-read" -> null
      - bucket                 = "www.visham.org" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain" -> null
      - etag                   = "fa1ded1ed7c11438a9b0385b1e112850" -> null
      - force_destroy          = false -> null
      - id                     = "robots.txt" -> null
      - key                    = "robots.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./src/robots.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

Plan: 2 to add, 1 to change, 14 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 7 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @roguecomp, Action: `pull_request`*